X=-5:0.2:5;
F1=-0.9*X.^3-4*X.^2+2*X+10;
F2=2*X.^2+sqrt(abs(X))-25;
figure(1);
plot(X,F1,'-*b',X,F2,'-*red');
grid on;

disp('__task 2____________________________________________')
disp("Решение полинома с помощью функции roots()")
F1=[-0.9, -4, 2, 10];
X=roots(F1)
disp("Проверка решения подстановкой, например, второго корня")
F1=-0.9*X(2).^3-4*X(2).^2+2*X(2)+10

disp('__task 3____________________________________________')
F11=inline('-0.9*X.^3-4*X.^2+2*X+10')
X1=fzero(F11, -4.4)
X2=fzero(F11, -1.6)
X3=fzero(F11, 1.6)
F22=inline('2*X.^2+sqrt(abs(X))-25')
X1=fzero(F22,-3.4)
X2=fzero(F22, 3.4)